app/Http/Controllers/FabLabController.php

select distinct `city` from `fab_labs`
---
        $fabLabs = $query->paginate(12)->withQueryString();

        // Get unique cities for filter (safe query)
        $cities = FabLab::distinct()->pluck('city')->filter()->sort()->values();